Revit 2026 API

# ApplicationNewPointOnEdge Method

---

Create a PointOnEdge object which is used to define the placement of a ReferencePoint.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointOnEdge NewPointOnEdge(
	Reference edgeReference,
	PointLocationOnCurve locationOnCurve
)
```
```vb
Public Function NewPointOnEdge (
	edgeReference As Reference,
	locationOnCurve As PointLocationOnCurve
) As PointOnEdge
```
```cpp
public:
PointOnEdge^ NewPointOnEdge(
	Reference^ edgeReference,
	PointLocationOnCurve^ locationOnCurve
)
```
```fsharp
member NewPointOnEdge :
        edgeReference : Reference *
        locationOnCurve : PointLocationOnCurve -> PointOnEdge
```

#### Parameters

edgeReference Reference
    The reference whose edge the object will be created on.
locationOnCurve PointLocationOnCurve
    The location on the edge.

#### Return Value

PointOnEdgeIf creation was successful then a new object is returned, otherwise an exception with failure information will be thrown.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument edgeReference or locationOnCurve is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace